Autodesk.Revit.DB.DisplacementPath.SetAnchorPoint(Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference,System.Double)
Sets the reference that determines the origin of this DisplacementPath.
displacementElement:
The element id of a DisplacementElement.
reference:
A reference of an edge or a curve in the GRep of the element corresponding to elemId.
param:
An parameter used to specify a point on the edge.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The value param should lie in the range [0,1].
-or-
reference does not represent an edge or curve belonging to an element displaced by displacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DisplacementPath.IsValidReference(Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference)
Does the specified pick represent an edge or a curve belonging to one of the displaced elements.
displacementElement:
A DisplacementElement.
reference:
A pick.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DisplacementPath.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.DisplacementElement,Autodesk.Revit.DB.Reference,System.Double)
Creates a new DisplacementPath referencing a DisplacementElement and edge or curve and adds it to the document.
aDoc:
The document.
displacementElement:
Element id of a DisplacementElement
reference:
A reference that refers to an edge or curve of one of the elements displaced by the displacementElement.
param:
A value in the range [0,1]. It will be interpreted as a parameter for the specified edge.
Returns:
The element id of the newly created DisplacementPath.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The value param should lie in the range [0,1].
-or-
reference does not represent an edge or curve belonging to an element displaced by displacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014